[
    {
        "name": "Harry Potter y la piedra filosofal",
        "year": 2001,
        "director": "Chris Colombus",
        "pic_sm": "foto-1-chica.jpg",
        "pic_lg": "foto-1-grande.jpg",
        "trailer": "https://www.youtube.com/watch?v=ZgrCZVjPg9g",
        "description": "La historia se trata de Harry Potter, un niño huérfano criado por sus tíos que lo odian. Desde que era pequeño, estos siempre le han contado que sus padres murieron en un accidente de coche. El día de su decimoprimer cumpleaños, Harry recibe la inesperada visita de un hombre que le revela que es hijo de dos poderosos magos y que él también posee extraordinarios poderes. Lleno de alegría, el chico acepta ir a estudiar a Hogwarts, el famoso colegio de magia y hechicería. Por fin, tiene la oportunidad de hacer amigos. Odiado por Severus Snape, profesor de Pociones, y protegido por Albus Dumbledore, director del colegio, Harry intentará dilucidar el misterio de la piedra filosofal."
    },
    {
        "name": "Harry Potter y la cámara secreta",
        "year": 2002,
        "director": "Chris Colombus",
        "pic_sm": "foto-1-chica.jpg",
        "pic_lg": "foto-1-grande.jpg",
        "trailer": "https://www.youtube.com/watch?v=MziLH3uow6E",
        "description": "Una noche, Dobby, un elfo, hace entonces aparición en la casa de Harry. Le anuncia que terribles peligros acechan el colegio Hogwarts y que no debe volver en septiembre. Harry no quiere creerle. Pero en cuanto vuelve al colegio, Harry oye una voz maligna. Esta le cuenta que la temible y legendaria cámara secreta se ha vuelto a abrir para que el heredero de Slytherin pueda sembrar el caos en Hogwarts. Las víctimas, encontradas petrificadas por una fuerza misteriosa, se suceden en los pasillos del colegio, sin que los profesores - ni siquiera el popular Gilderoy Lockhart - consigan poner fin a la amenaza. Con la ayuda de Ron y Hermione, Harry debe actuar lo más rápido posible para salvar Hogwarts."
    },
    {
        "name": "Harry Potter y el prisionero de Azkaban",
        "year": 2004,
        "director": "Alfonso Cuarón",
        "pic_sm": "foto-1-chica.jpg",
        "pic_lg": "foto-1-grande.jpg",
        "trailer": "https://www.youtube.com/watch?v=cUtaBkW1MKo",
        "description": "La tercera entrega de la saga Harry Potter nos cuenta el transcurso del tercer año del protagonista en el colegio Hogwarts. Al inicio de este, Potter descubre algunas novedades; por ejemplo, que Sirius Black, uno de los asesinos de Lord Voldemort, se ha escapado de Azkaban y que todos se hallan preocupados por si este llegara a acabar con el joven Harry. A pesar de que en el colegio se toman fuertes medidas de seguridad para evitar la tragedia, el mago terminará entablando una relación con el prófugo."
    },
    {
        "name": "Harry Potter y el cáliz de fuego",
        "year": 2005,
        "director": "Mike Newell",
        "pic_sm": "foto-1-chica.jpg",
        "pic_lg": "foto-1-grande.jpg",
        "trailer": "https://www.youtube.com/watch?v=wX5dWfUKGPg",
        "description": "Harry Potter empieza a tener sueños donde escucha como Lord Voldemort conspira junto con Peter Pettigrew y un chico joven que también se encuentra en la casa. A todo esto, Hogwards se prepara para el Torneo de los Tres magos, donde participan las tres escuelas de magia más famosas de Europa: Hogwarts, Beauxbatons y Durmstrang. Existe una ley que establece que para participar en estas pruebas se debe tener, al menos, 17 años. Sin embargo, una mano misteriosa provoca que Harry, con tan solo 14 años, sea elegido para participar. Aunque Dumbledore y Minerva McGonagall se oponen, dejan que el joven participe hasta que se aclare el asunto y se sepa porque no se han respetado las reglas. También asignan al nuevo profesor de artes oscuras, Alastor Moody, a que vigile a Harry hasta que finalice el torneo."
    },
    {
        "name": "Harry Potter y la Orden del Fénix",
        "year": 2007,
        "director": "David Yates",
        "pic_sm": "foto-1-chica.jpg",
        "pic_lg": "foto-1-grande.jpg",
        "trailer": "https://www.youtube.com/watch?v=jdEulcjAvQI",
        "description": "Al comienzo de su quinto año de estudios en Hogwarts, Harry Potter descubre que la comunidad de magos no parece creerse el regreso de Voldemort, convencida por una campaña de desinformación orquestada por el Ministro de la Magia, Cornelius Fudge. Para mantener el colegio vigilado, Fudge manda a Hogwarts a un nuevo profesor de Defensa Contra las Artes Oscuras, Dolores Umbridge, encargada de hacer respetar el orden en el colegio y supervisar los actos y gestos de Dumbledore. Sin tratar de ocultar su gran desinterés por los alumnos del curso, la autoproclamada Suma Inquisidora de Hogwarts también parece estar decidida a hacer lo que sea para humillar a Harry. Rodeado de sus amigos Ron y Hermione, crea un grupo llamado El Ejército de Dumbledore al que enseña el arte de la defensa contra las artes oscuras, preparándolo para la guerra que se avecina."
    },
    {
        "name": "Harry Potter y el misterio del príncipe",
        "year": 2009,
        "director": "David Yates",
        "pic_sm": "foto-1-chica.jpg",
        "pic_lg": "foto-1-grande.jpg",
        "trailer": "https://www.youtube.com/watch?v=CHiGk9bEht8",
        "description": "La sombra demoniaca de Voldemort se cierne cada vez más sobre el universo de los Muggle y el mundo de la magia. Hogwarts ha dejado de ser un remanso de paz, el peligro ronda en el corazón del castillo, pero Dumbledore está más decidido que nunca a preparar a Harry para su combate final, ahora inminente. Juntos, el viejo maestro y el joven mago van a intentar romper las defensas de Voldemort. Para ayudarle, Dumbledore va a acosar y manipular a su antiguo colega, el profesor Horace Slughorn, al que cree en posesión de una información vital sobre el joven Voldemort. "
    },
    {
        "name": "Harry Potter y las reliquias de la muerte - Parte 1",
        "year": 2010,
        "director": "David Yates",
        "pic_sm": "foto-1-chica.jpg",
        "pic_lg": "foto-1-grande.jpg",
        "trailer": "https://www.youtube.com/watch?v=GdNvFDzSNHQ",
        "description": "En esta ocasión, Harry Potter y sus amigos Ron y Hermione tendrán que cargar sobre sus hombros con la tarea más difícil que un mago puede afrontar: destruir los horrocruxes que aún quedan en el mundo para poner fin al reinado de Lord Voldemort. Harry, Ron y Hermione tienen que recorrer Inglaterra casi a ciegas en busca de los objetos que hacen al Señor Tenebroso más longevo. Pero el poder del lado oscuro no para de aumentar y los acólitos de El que no debe ser nombrado se cuentan ya por miles, por lo que Harry tendrá que recurrir a todas las enseñanzas y consejos que Dumbledore le transmitió antes de su muerte. ¿Será capaz Harry de cambiar el destino del mundo mágico?"
    },
    {
        "name": "Harry Potter y las reliquias de la muerte - Parte 2",
        "year": 2011,
        "director": "David Yates",
        "pic_sm": "foto-1-chica.jpg",
        "pic_lg": "foto-1-grande.jpg",
        "trailer": "https://www.youtube.com/watch?v=7Ay2BjeZvrM",
        "description": " Harry Potter, Hermione y Ron continúan intentando dar con el paradero de los Horrocruxes, los pedazos de alma que Voldemort escondió en diversos objetos relacionados con su vida para conseguir su mayor deseo: la inmortalidad. Es su única oportunidad para que Harry, 'El Elegido', tenga alguna posibilidad de acabar con ´El que no debe ser nombrado´ y de librar al mundo de la magia y de los 'muggles' de un futuro oscuro y aterrador. El problema reside en que ninguno sabe dónde están."
    }
]